app/controllers/photos_controller.rb

  def index
    @photos = Photo.paginate(:page =>params[:page]||1,
      :per_page =>10,
      :order=>"updated_at DESC")
---
SELECT * FROM `photos` ORDER BY updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `photos`

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save
---
INSERT INTO `photos` (`image_file_size`, `updated_at`, `screenwrite`, `title`, `language`, `imdb`, `director_id`, `image_content_type`, `image_remote_url`, `country_id`, `description`, `length`, `starring`, `is_avatar`, `user_id`, `published_at`, `image_updated_at`, `created_at`, `image_file_name`) VALUES(56159, '2011-04-20 11:37:23', NULL, NULL, NULL, NULL, NULL, 'image/jpeg', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, '2011-04-20 11:37:21', '2011-04-20 11:37:23', 'b_1244482988722.jpg')

  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(params[:photo])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
UPDATE `photos` SET `image_file_name` = 'http_imgloa.jpg', `image_file_size` = 41286, `image_updated_at` = '2011-04-03 08:42:48', `updated_at` = '2011-04-03 08:42:49' WHERE `id` = 1