app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '068bdaebc5b59e34c485c3de956c9502bde1a6a9', '2011-04-03 08:31:23', 'fccc451c6d87a7ae75c118ec4659c8d1f48eca0f', NULL, NULL, 'wd829', '471870157@qq.com', '2011-04-03 08:31:23')